#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.dev.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/DevMemos]
module.dev.azurerm_app_service_plan.this: Refreshing state... [id=/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/DevMemos/providers/Microsoft.Web/serverfarms/devmemos-asp]
module.dev.azurerm_app_service.this: Refreshing state... [id=/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/DevMemos/providers/Microsoft.Web/sites/devmemos]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dev.azurerm_sql_database.this will be created
  + resource "azurerm_sql_database" "this" {
      + collation                        = (known after apply)
      + create_mode                      = "Default"
      + creation_date                    = (known after apply)
      + default_secondary_location       = (known after apply)
      + edition                          = "Basic"
      + elastic_pool_name                = (known after apply)
      + encryption                       = (known after apply)
      + id                               = (known after apply)
      + location                         = "westus2"
      + max_size_bytes                   = (known after apply)
      + max_size_gb                      = (known after apply)
      + name                             = "memos"
      + read_scale                       = false
      + requested_service_objective_id   = (known after apply)
      + requested_service_objective_name = "Basic"
      + resource_group_name              = "DevMemos"
      + restore_point_in_time            = (known after apply)
      + server_name                      = "devmemos-sqlsvr"
      + source_database_deletion_date    = (known after apply)
      + source_database_id               = (known after apply)
      + tags                             = {
          + "environment" = "production"
        }

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
          + use_server_default         = (known after apply)
        }
    }

  # module.dev.azurerm_sql_firewall_rule.allow_azure_services will be created
  + resource "azurerm_sql_firewall_rule" "allow_azure_services" {
      + end_ip_address      = "0.0.0.0"
      + id                  = (known after apply)
      + name                = "AllowAzureServices"
      + resource_group_name = "DevMemos"
      + server_name         = "devmemos-sqlsvr"
      + start_ip_address    = "0.0.0.0"
    }

  # module.dev.azurerm_sql_server.this will be created
  + resource "azurerm_sql_server" "this" {
      + administrator_login          = "dbadmin"
      + administrator_login_password = (sensitive value)
      + connection_policy            = "Default"
      + fully_qualified_domain_name  = (known after apply)
      + id                           = (known after apply)
      + location                     = "westus2"
      + name                         = "devmemos-sqlsvr"
      + resource_group_name          = "DevMemos"
      + tags                         = {
          + "environment" = "Dev"
        }
      + version                      = "12.0"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.plan"

Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @Sheludchenko, Action: `pull_request`, Working Directory: ``, Workflow: `Infrastructure`*